app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    @urls = Url.all

INSERT INTO "urls" ("long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_url", "www.facebook.com"], ["short_url", "epz1j63k"], ["created_at", "2017-05-11 04:42:54.282444"], ["updated_at", "2017-05-11 04:42:54.282444"]]
---
  def create
    @url = Url.new(url_params)
    @url.shorten
    # if @url.save
    #   redirect_to @url
    # else
    #   render 'new'
    # end
    if @url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @url = Url.find(params[:id])